2019/sql-relational-algebra.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SQL 与关系代数</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">SQL 与关系代数</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcce7dd9">1. 前言</a></li>
<li><a href="#org67b136a">2. 关系与表</a></li>
<li><a href="#orgcf5a28c">3. 关系代数的基本运算</a>
<ul>
<li><a href="#org9b8598e">3.1. 投影</a></li>
<li><a href="#org0428ef1">3.2. 选择</a></li>
<li><a href="#orgbd393c6">3.3. 并运算</a></li>
<li><a href="#orgac0efe7">3.4. 集合差运算</a></li>
<li><a href="#org6535460">3.5. 笛卡尔积</a></li>
<li><a href="#orgcdc00e6">3.6. 更名运算</a></li>
</ul>
</li>
<li><a href="#org7debbaf">4. 关系代数的附加运算</a>
<ul>
<li><a href="#org44d9a3c">4.1. 集合交运算</a></li>
<li><a href="#org763d6ab">4.2. 连接运算</a>
<ul>
<li><a href="#org5ed03a1">4.2.1. 自然连接</a></li>
<li><a href="#org1445d4f">4.2.2. 内连接</a></li>
<li><a href="#org7c44152">4.2.3. 外连接</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org723caf8">5. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcce7dd9" class="outline-2">
<h2 id="orgcce7dd9"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
SQL 是基于关系代数的查询语言，假如学习过 SQL 和关系代数，你就会发现，在 SQL 的查询语句中你会发现很多关系代数的影子。
</p>

<p>
然而，虽然知道 SQL 和关系代数密切相关，但是我也不知道学了关系代数对学习 SQL 有什么好处，因此，如果你对关系代数没兴趣的话，现在就可以关掉这篇博客了。
</p>
</div>
</div>

<div id="outline-container-org67b136a" class="outline-2">
<h2 id="org67b136a"><span class="section-number-2">2</span> 关系与表</h2>
<div class="outline-text-2" id="text-2">
<p>
我们可以把数据库中的表和关系代数中的关系看做是一个东西，这里给出接下来会用到的两个关系（表）：
</p>

<ul class="org-ul">
<li><p>
User:
</p>
<pre class="example">
+------+---------+--------+
| id   | account | passwd |
+------+---------+--------+
|    1 | 123     | ****** |
|    2 | 456     | ****** |
+------+---------+--------+
</pre></li>
<li><p>
Profile
</p>
<pre class="example">
+------+------+------+
| id   | name | age  |
+------+------+------+
|    1 | tony |   16 |
|    3 | john |    2 |
+------+------+------+
</pre></li>
</ul>
</div>
</div>

<div id="outline-container-orgcf5a28c" class="outline-2">
<h2 id="orgcf5a28c"><span class="section-number-2">3</span> 关系代数的基本运算</h2>
<div class="outline-text-2" id="text-3">
<p>
关系代数的基本运算包括：选择、投影、并、集合差、笛卡尔积和更名。
</p>
</div>

<div id="outline-container-org9b8598e" class="outline-3">
<h3 id="org9b8598e"><span class="section-number-3">3.1</span> 投影</h3>
<div class="outline-text-3" id="text-3-1">
<p>
这里我们可以先来看一看 <b>投影</b> 运算，它的作用和 SQL 中的 <code>SELECT</code> 基本相同。
</p>

<p>
比如说我们要选择 <code>User</code> 中的 <code>account</code>, 用 SQL 编写的话就是：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> account <span class="org-keyword">FROM</span> <span class="org-builtin">user</span>;
</pre>
</div>

<p>
如果用关系代数来写的话，就可以写成 \(\prod_{account}(user)\).
</p>

<p>
选择多列就可以这样： \(\prod_{id,account}(user)\).
</p>
</div>
</div>

<div id="outline-container-org0428ef1" class="outline-3">
<h3 id="org0428ef1"><span class="section-number-3">3.2</span> 选择</h3>
<div class="outline-text-3" id="text-3-2">
<p>
由于一些历史原因，关系代数中的选择和 SQL 中的 <code>SELECT</code> 不是一个意思，而是更接近 <code>WHERE</code>, 我们可以通过选择运算选择关系中符合指定条件的部分。
</p>

<p>
比如说 \(\sigma_{id=1}(user)\) 可以选择关系 <code>User</code> 中 <code>id</code> 等于 <code>1</code> 的用户，其等价的 SQL 语句如下：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">WHERE</span> id = 1;
</pre>
</div>

<p>
选择运算中可以使用的谓词包括： \(=, \neq, <, \leqslant, >, \geqslant\). 同时还可以使用连词 \(and(\land), or(\lor), not(\lnot)\) 将多个谓词合并为一个较大的连词。
</p>

<p>
比如说 \(\sigma_{id \geqslant 1 \land id < 3}\) 选择 <code>id</code> 范围在 <code>[1, 3)</code> 之间的用户，等价于：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">WHERE</span> id &gt;= 1 <span class="org-keyword">AND</span> id &lt; 3; 
</pre>
</div>

<p>
同时，由于关系运算的结果依然是一个关系，因此，我们可以将关系运算组合起来，比如：选择 id 为一的用户的 account 可以表示为 \(\prod_{account}(\sigma_{id=1}(user))\)
</p>
</div>
</div>

<div id="outline-container-orgbd393c6" class="outline-3">
<h3 id="orgbd393c6"><span class="section-number-3">3.3</span> 并运算</h3>
<div class="outline-text-3" id="text-3-3">
<p>
并运算可以将两个集合并起来，对应到 SQL 中就是 <code>UNION</code> 操作，比如说获取 User 和 Profile 中的所有 ID：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">UNION</span> <span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> profile;
</pre>
</div>

<p>
用关系代数来表示的话就是： \(\prod_{id}(user) \cup \prod_{id}(profile)\).
</p>

<p>
关系代数的并运算和 SQL 中的 <code>UNION</code> 一样，要求需要并起来的关系的 <b>列</b> 是相同的，同时，比 SQL 更严格的是，关系代数的并运算还要求列的位置相同。
</p>
</div>
</div>

<div id="outline-container-orgac0efe7" class="outline-3">
<h3 id="orgac0efe7"><span class="section-number-3">3.4</span> 集合差运算</h3>
<div class="outline-text-3" id="text-3-4">
<p>
集合差运算可以从一个集合中排除另一个集合中的内容，对于到 SQL 中就是 <code>EXCEPT</code> 操作，比如获取 User 不在 Profile 中的所有 ID<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">EXCEPT</span> <span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> profile;
</pre>
</div>

<p>
用关系代数来表示的话就是： \(\prod_{id}(user) - \prod_{id}(profile)\).
</p>

<p>
集合差运算对不同关系的要求和并运算是相同的。
</p>
</div>
</div>

<div id="outline-container-org6535460" class="outline-3">
<h3 id="org6535460"><span class="section-number-3">3.5</span> 笛卡尔积</h3>
<div class="outline-text-3" id="text-3-5">
<p>
笛卡尔积是一个很重要的运算，通过笛卡尔积我们可以将 <b>任意</b> 两个关系的信息结合在一起，笛卡尔积的运算结果会将两个关系的所有列作为新的关系的列，将两个关系的所有行的组合作为新的关系的行。
</p>

<p>
对应到 SQL 中便是 <code>CROSS JOIN</code>, 比如说如下 SQL 语句便可以表示为 \(user \times profile\):
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">CROSS</span> <span class="org-keyword">JOIN</span> profile;
</pre>
</div>

<p>
运算结果如下：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
|    2 | 456     | ****** |    1 | tony |   16 |
|    1 | 123     | ****** |    3 | john |    2 |
|    2 | 456     | ****** |    3 | john |    2 |
+------+---------+--------+------+------+------+
</pre>
</div>
</div>

<div id="outline-container-orgcdc00e6" class="outline-3">
<h3 id="orgcdc00e6"><span class="section-number-3">3.6</span> 更名运算</h3>
<div class="outline-text-3" id="text-3-6">
<p>
关系代数中的更名运算对应到 SQL 中便等价于 <code>AS</code> 操作，可以对关系进行更名也可以对列进行更名操作：
</p>
<ul class="org-ul">
<li>更名关系 - \(\rho_{users}(user)\)</li>
<li>更名列 - \(\rho_{users(uid,account,password)}(user)\)</li>
</ul>

<p>
在进行连接操作的时候常常会用到更名操作，而 SQL 中的更名操作用起来比关系代数中的方便一些，形象一些。
</p>
</div>
</div>
</div>

<div id="outline-container-org7debbaf" class="outline-2">
<h2 id="org7debbaf"><span class="section-number-2">4</span> 关系代数的附加运算</h2>
<div class="outline-text-2" id="text-4">
<p>
关系代数的附加运算是可以通过基本运算推导得出的，包括集合交运算和各类连接运算。
</p>
</div>

<div id="outline-container-org44d9a3c" class="outline-3">
<h3 id="org44d9a3c"><span class="section-number-3">4.1</span> 集合交运算</h3>
<div class="outline-text-3" id="text-4-1">
<p>
集合交运算计算两个关系中都存在的部分，可以通过基本运算表示： \(r \cap s = r - (r - s)\).
</p>

<p>
集合交运算对于的 SQL 语句是 <code>INTERSECT</code>, 比如：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">INTERSECT</span> <span class="org-keyword">SELECT</span> id <span class="org-keyword">FROM</span> profile;
</pre>
</div>

<p>
表示为关系代数便是 \(\prod_{id}(user) \cap \prod_{id}(profile)\).
</p>
</div>
</div>

<div id="outline-container-org763d6ab" class="outline-3">
<h3 id="org763d6ab"><span class="section-number-3">4.2</span> 连接运算</h3>
<div class="outline-text-3" id="text-4-2">
<p>
个人认为连接运算是所有运算中最难的一种，它存在很多分类，比如：自然连接、内连接、外连接等。
</p>

<p>
同时，不同的连接运算之间还存在不浅的关系，因此，需要好好理解才行。
</p>
</div>

<div id="outline-container-org5ed03a1" class="outline-4">
<h4 id="org5ed03a1"><span class="section-number-4">4.2.1</span> 自然连接</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
首先是自然连接，自然连接将两个关系的 <b>属性集</b> 的 <b>并集</b> 作为新的关系的属性，同时会对两个关系中的相同属性进行比较筛选。
</p>

<p>
假如两个关系不存在相同的属性，那么自然连接的结果便和 <b>笛卡尔积</b> 相同：
</p>
<pre class="example">
+------+---------+--------+------+------+
| id   | account | passwd | name | age  |
+------+---------+--------+------+------+
|    1 | 123     | ****** | tony |   16 |
+------+---------+--------+------+------+
</pre>

<p>
如上便是 <b>自然连接</b> 的运算结果，它将关系 User 和 Profile 的属性的并集作为新关系的属性，同时筛选具有相同 ID 值的行。
</p>

<p>
连接运算的关系代数形式都很复杂，这里就简单列出对应的 SQL 语句好了<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">NATURAL</span> <span class="org-keyword">JOIN</span> profile;
</pre>
</div>
</div>
</div>

<div id="outline-container-org1445d4f" class="outline-4">
<h4 id="org1445d4f"><span class="section-number-4">4.2.2</span> 内连接</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
可以把内连接<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>  看做添加了选择语句的笛卡尔积，也就是说，计算内连接时需要先行计算出笛卡尔积，然后在根据选择条件进行选择。
</p>

<p>
比如这样的内连接操作：
</p>
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> profile <span class="org-keyword">ON</span> <span class="org-builtin">user</span>.id &gt;= profile.id;
</pre>
</div>

<p>
其结果为：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
|    2 | 456     | ****** |    1 | tony |   16 |
+------+---------+--------+------+------+------+
</pre>

<p>
这里可以对照笛卡尔积的计算结果进行理解：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
|    2 | 456     | ****** |    1 | tony |   16 |
|    1 | 123     | ****** |    3 | john |    2 |
|    2 | 456     | ****** |    3 | john |    2 |
+------+---------+--------+------+------+------+
</pre>
</div>
</div>

<div id="outline-container-org7c44152" class="outline-4">
<h4 id="org7c44152"><span class="section-number-4">4.2.3</span> 外连接</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
我们可以把外连接看做是 <b>内连接</b> 的扩展<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup>，首先计算出两个关系内连接的结果，然后根据外连接的类型补充数据到内连接的结果上。
</p>

<p>
比如说左外连接，首先可以计算出 User 和 Profile 的内连接，然后用空值来填充在左侧关系中存在而右侧关系中不存在的项就可以了。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> <span class="org-builtin">user</span> <span class="org-keyword">LEFT</span> <span class="org-keyword">JOIN</span> profile <span class="org-keyword">on</span> <span class="org-builtin">user</span>.id = profile.id;
</pre>
</div>

<p>
这条 SQL 语句的执行结果为：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
|    2 | 456     | ****** | NULL | NULL | NULL |
+------+---------+--------+------+------+------+
</pre>

<p>
如果将其替换为内连接的话便是：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
+------+---------+--------+------+------+------+
</pre>

<p>
可以看到，ID 为 2 的项只存在于 User 中而不存在与 Profile 中，因此，左外连接时使用了空值来填充 Profile 对应的部分，保证 User 的每项都存在。
</p>

<p>
依次类推，右外连接、全外连接也就好理解了：
</p>
<ul class="org-ul">
<li><p>
右外连接的执行结果：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
| NULL | NULL    | NULL   |    3 | john |    2 |
+------+---------+--------+------+------+------+
</pre></li>
<li><p>
全外连接的执行结果：
</p>
<pre class="example">
+------+---------+--------+------+------+------+
| id   | account | passwd | id   | name | age  |
+------+---------+--------+------+------+------+
|    1 | 123     | ****** |    1 | tony |   16 |
|    2 | 456     | ****** | NULL | NULL | NULL |
| NULL | NULL    | NULL   |    3 | john |    2 |
+------+---------+--------+------+------+------+
</pre></li>
</ul>

<p>
其实，这三个外连接是可以互相转换的，将两个关系的位置换一下就可以将左外连接转换为右外连接，而将左右外连接的结果并起来就可以得到全外连接了。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org723caf8" class="outline-2">
<h2 id="org723caf8"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
虽然说关系代数和 SQL 有不浅的关系，但是学了关系代数，对编写 SQL 也没有多大的帮助 @_@
</p>

<p>
而且，不同的数据库实现 SQL 的语法还存在细微的差别……
</p>

<p>
也许，可以借助关系代数表达式来生成 SQL 语句！
</p>

<details><summary><i></i></summary>

<p>
其实关系代数还有一些扩展运算，对应到 SQL 中便是聚集、分组之类的，博客中没有说到，有兴趣的话可以去了解一下。
</p>

<p>
或者什么时候有时间了补上 @_@
</p>

</details>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
不同数据库对 <code>EXCEPT</code> 子句的支持存在区别，这里的 SQL 语句不一定能运行通过
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
如果有兴趣可以看看书《<a href="https://book.douban.com/subject/10548379/">数据库系统概念</a>》中的描述
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
其实在关系代数中内连接应该叫做 <b>theta 连接</b>, 这里主要是为了和 SQL 相对应
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
其实按照书《<a href="https://book.douban.com/subject/10548379/">数据库系统概念</a>》中的描述的话应该是 <b>自然连接</b>, 但是实际的操作结果更符合 <b>内连接</b>, 虽然说，内连接也可以看做是自然连接
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
